[Killed] ArrowFunction
src/jewellery.ts:31:28
 
 export type Jewellery = Earring | Ring | Pendant | Necklace | PendantNecklace;
 
-export const makeEarring = (stone: Jewel, type: EarringType): Earring => ({
-  _kind: "Earring",
-  size() {
-    return this.type === "Stud" ? "Small" : "Large";
-  },
-  type,
-  stone,
-});
+export const makeEarring = () => undefined;
 
 export const makeNecklace = (stone: Jewel, type: NecklaceType): Necklace => ({
killedBy: The packer with other stones a large item earring of type hoop
statusReason: TypeError: Cannot read properties of undefined (reading 'stone')

[Killed] BlockStatement
src/jewellery.ts:33:10
 
 export const makeEarring = (stone: Jewel, type: EarringType): Earring => ({
   _kind: "Earring",
-  size() {
-    return this.type === "Stud" ? "Small" : "Large";
-  },
+  size() {},
   type,
   stone,
killedBy: The packer with other stones a large item earring of type stud
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Earring", "size": [Function size], "stone": "Amber", "type": "Stud"}
Received: undefined

[Killed] ConditionalExpression
src/jewellery.ts:34:12
 export const makeEarring = (stone: Jewel, type: EarringType): Earring => ({
   _kind: "Earring",
   size() {
-    return this.type === "Stud" ? "Small" : "Large";
+    return true ? "Small" : "Large";
   },
   type,
killedBy: The packer with other stones a large item earring of type hoop
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Earring", "size": [Function size], "stone": "Amber", "type": "Hoop"}
Received: undefined

[Killed] EqualityOperator
src/jewellery.ts:34:12
 export const makeEarring = (stone: Jewel, type: EarringType): Earring => ({
   _kind: "Earring",
   size() {
-    return this.type === "Stud" ? "Small" : "Large";
+    return this.type !== "Stud" ? "Small" : "Large";
   },
   type,
killedBy: The packer with other stones a large item earring of type hoop
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Earring", "size": [Function size], "stone": "Amber", "type": "Hoop"}
Received: undefined

[Killed] ArrowFunction
src/jewellery.ts:40:29
   stone,
 });
 
-export const makeNecklace = (stone: Jewel, type: NecklaceType): Necklace => ({
-  _kind: "Necklace",
-  size() {
-    return ["Beads", "LongChain"].includes(this.type) ? "Large" : "Small";
-  },
-  type,
-  stone,
-});
+export const makeNecklace = () => undefined;
 
 export const makePendantNecklace = (
killedBy: The packer when packing a necklace with diamond
statusReason: TypeError: Cannot read properties of undefined (reading 'stone')

[Killed] BlockStatement
src/jewellery.ts:42:10
 
 export const makeNecklace = (stone: Jewel, type: NecklaceType): Necklace => ({
   _kind: "Necklace",
-  size() {
-    return ["Beads", "LongChain"].includes(this.type) ? "Large" : "Small";
-  },
+  size() {},
   type,
   stone,
killedBy: The packer when packing a necklace with other stones small
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Amber", "type": "Chain"}
Received: undefined

[Killed] StringLiteral
src/jewellery.ts:43:57
 export const makeNecklace = (stone: Jewel, type: NecklaceType): Necklace => ({
   _kind: "Necklace",
   size() {
-    return ["Beads", "LongChain"].includes(this.type) ? "Large" : "Small";
+    return ["Beads", "LongChain"].includes(this.type) ? "" : "Small";
   },
   type,
killedBy: The packer when packing a necklace with other stones large pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Plain", "type": "Beads"}
Received: undefined

[Survived] StringLiteral
src/jewellery.ts:43:22
 export const makeNecklace = (stone: Jewel, type: NecklaceType): Necklace => ({
   _kind: "Necklace",
   size() {
-    return ["Beads", "LongChain"].includes(this.type) ? "Large" : "Small";
+    return ["Beads", ""].includes(this.type) ? "Large" : "Small";
   },
   type,

[Killed] ArrowFunction
src/jewellery.ts:49:36
   stone,
 });
 
-export const makePendantNecklace = (
-  pendant: Jewel,
-  chain: NecklaceType
-): PendantNecklace => ({
-  _kind: "Necklace",
-  type: "Pendant",
-  stone: "Plain",
-  chain: makeNecklace("Plain", chain),
-  pendant: makePendant(pendant),
-  size() {
-    if (this.chain.size() === "Large" || this.pendant.size() == "Large")
-      return "Large";
-    return "Small";
-  },
-});
+export const makePendantNecklace = () => undefined;
 
 export const makePendant = (stone: Jewel): Pendant => ({
killedBy: The packer when packing a necklace with other stones large pendant
statusReason: TypeError: Cannot read properties of undefined (reading 'stone')

[Killed] StringLiteral
src/jewellery.ts:54:9
   chain: NecklaceType
 ): PendantNecklace => ({
   _kind: "Necklace",
-  type: "Pendant",
+  type: "",
   stone: "Plain",
   chain: makeNecklace("Plain", chain),
killedBy: The packer when packing a necklace with other stones large pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  0
+ Received  + 11

  Object {
    "_kind": "Necklace",
+   "chain": Object {

[Survived] StringLiteral
src/jewellery.ts:55:10
 ): PendantNecklace => ({
   _kind: "Necklace",
   type: "Pendant",
-  stone: "Plain",
+  stone: "",
   chain: makeNecklace("Plain", chain),
   pendant: makePendant(pendant),

[Killed] BlockStatement
src/jewellery.ts:58:10
   stone: "Plain",
   chain: makeNecklace("Plain", chain),
   pendant: makePendant(pendant),
-  size() {
-    if (this.chain.size() === "Large" || this.pendant.size() == "Large")
-      return "Large";
-    return "Small";
-  },
+  size() {},
 });
 
killedBy: The packer when packing a jewellery item given the travel roll already includes an item a large item
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not {"_kind": "Necklace", "chain": {"_kind": "Necklace", "size": [Function size], "stone": "Plain", "type": "Beads"}, "pendant": {"_kind": "Pendant", "size": [Function anonymous], "stone": "Amber"}, "size": [Function size], "stone": "Plain", "type": "Pendant"}

[Killed] LogicalOperator
src/jewellery.ts:59:9
   chain: makeNecklace("Plain", chain),
   pendant: makePendant(pendant),
   size() {
-    if (this.chain.size() === "Large" || this.pendant.size() == "Large")
+    if (this.chain.size() === "Large" && this.pendant.size() == "Large")
       return "Large";
     return "Small";
killedBy: The packer when packing a necklace with other stones large pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Plain", "type": "Beads"}
Received: undefined

[Killed] EqualityOperator
src/jewellery.ts:59:9
   chain: makeNecklace("Plain", chain),
   pendant: makePendant(pendant),
   size() {
-    if (this.chain.size() === "Large" || this.pendant.size() == "Large")
+    if (this.chain.size() !== "Large" || this.pendant.size() == "Large")
       return "Large";
     return "Small";
killedBy: The packer when packing a necklace with other stones large pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Plain", "type": "Beads"}
Received: undefined

[Survived] ArrowFunction
src/jewellery.ts:65:28
   },
 });
 
-export const makePendant = (stone: Jewel): Pendant => ({
-  _kind: "Pendant",
-  stone,
-  size: () => "Small",
-});
+export const makePendant = () => undefined;
 
 export const makeRing = (stone: Jewel): Ring => ({

[Survived] ArrowFunction
src/jewellery.ts:68:9
 export const makePendant = (stone: Jewel): Pendant => ({
   _kind: "Pendant",
   stone,
-  size: () => "Small",
+  size: () => undefined,
 });
 

[Killed] ArrowFunction
src/jewellery.ts:71:25
   size: () => "Small",
 });
 
-export const makeRing = (stone: Jewel): Ring => ({
-  _kind: "Ring",
-  size: () => "Small",
-  stone,
-});
+export const makeRing = () => undefined;
 
 export interface JewelleryBox {
killedBy: The packer When packing a ring
statusReason: TypeError: Cannot read properties of undefined (reading 'size')

[Killed] ArrowFunction
src/jewellery.ts:73:9
 
 export const makeRing = (stone: Jewel): Ring => ({
   _kind: "Ring",
-  size: () => "Small",
+  size: () => undefined,
   stone,
 });
killedBy: The packer When packing a ring
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Small"
Received: undefined
