[Killed] BlockStatement
src/chainOfResponsibility.ts:25:116
   item: Necklace | PendantNecklace
 ) => Result;
 
-export const chain = (currentHandler: StorageHandler, nextHandler: StorageHandler): StorageHandler => (...args) => {
-  const result = currentHandler(...args);
-
-  if (result === Result.Skipped) {
-    return nextHandler(...args);
-  }
-
-  return result;
-};
+export const chain = (currentHandler: StorageHandler, nextHandler: StorageHandler): StorageHandler => (...args) => {};
 
killedBy: The packer when packing a necklace with diamond
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Diamond", "type": "Chain"}
Received: undefined

[Killed] ArrowFunction
src/chainOfResponsibility.ts:25:22
   item: Necklace | PendantNecklace
 ) => Result;
 
-export const chain = (currentHandler: StorageHandler, nextHandler: StorageHandler): StorageHandler => (...args) => {
-  const result = currentHandler(...args);
-
-  if (result === Result.Skipped) {
-    return nextHandler(...args);
-  }
-
-  return result;
-};
+export const chain = () => undefined;
 
killedBy: The packer when packing a necklace with diamond
statusReason: TypeError: chainRoot is not a function

[Killed] ConditionalExpression
src/chainOfResponsibility.ts:28:7
 export const chain = (currentHandler: StorageHandler, nextHandler: StorageHandler): StorageHandler => (...args) => {
   const result = currentHandler(...args);
 
-  if (result === Result.Skipped) {
+  if (false) {
     return nextHandler(...args);
   }
killedBy: The packer when packing a necklace with other stones small
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Amber", "type": "Chain"}
Received: undefined

[Killed] BlockStatement
src/chainOfResponsibility.ts:28:34
 export const chain = (currentHandler: StorageHandler, nextHandler: StorageHandler): StorageHandler => (...args) => {
   const result = currentHandler(...args);
 
-  if (result === Result.Skipped) {
-    return nextHandler(...args);
-  }
+  if (result === Result.Skipped) {}
 
   return result;
killedBy: The packer when packing a necklace with other stones small
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Amber", "type": "Chain"}
Received: undefined
