[Killed] BlockStatement
src/index.ts:9:60
 } from "./jewellery";
 import { StorageHandler, Result, LeafStorageHandler, chain } from './chainOfResponsibility';
 
-const topShelfHandler: StorageHandler = (storage, item) => {
-  if (item.size() === "Small") {
-    storage.box.topShelf.push(item);
-
-    return Result.Success;
-  }
-
-  // TODO: maybe the handler should not be concerned with item type
-  // storing each part of the jewellery could be the responsibility of
-  // a higher-level component
-  storage.box.topShelf.push((item as PendantNecklace).pendant);
-
-  // TODO: temp fix; the result is not accurate
-  // the handler was successful, but the pendant is only partially stored;
-  return Result.Skipped;
-};
+const topShelfHandler: StorageHandler = (storage, item) => {};
 
 const treeHandler: LeafStorageHandler = (storage, item) => {
killedBy: The packer when packing a necklace with other stones small
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Amber", "type": "Chain"}
Received: undefined

[Killed] EqualityOperator
src/index.ts:10:7
 import { StorageHandler, Result, LeafStorageHandler, chain } from './chainOfResponsibility';
 
 const topShelfHandler: StorageHandler = (storage, item) => {
-  if (item.size() === "Small") {
+  if (item.size() !== "Small") {
     storage.box.topShelf.push(item);
 
killedBy: The packer when packing a necklace with other stones small
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Amber", "type": "Chain"}
Received: undefined

[Killed] ConditionalExpression
src/index.ts:10:7
 import { StorageHandler, Result, LeafStorageHandler, chain } from './chainOfResponsibility';
 
 const topShelfHandler: StorageHandler = (storage, item) => {
-  if (item.size() === "Small") {
+  if (true) {
     storage.box.topShelf.push(item);
 
killedBy: The packer when packing a necklace with other stones large pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Plain", "type": "Beads"}
Received: undefined

[Killed] BlockStatement
src/index.ts:26:60
   return Result.Skipped;
 };
 
-const treeHandler: LeafStorageHandler = (storage, item) => {
-  const thingToStore = item.type === "Pendant" ? item.chain : item;
-
-  storage.tree.push(thingToStore);
-
-  return Result.Success
-}
+const treeHandler: LeafStorageHandler = (storage, item) => {}
 
 const safeHandler: StorageHandler = (storage, item) => {
killedBy: The packer when packing a necklace with other stones large pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Plain", "type": "Beads"}
Received: undefined

[Killed] ConditionalExpression
src/index.ts:27:24
 };
 
 const treeHandler: LeafStorageHandler = (storage, item) => {
-  const thingToStore = item.type === "Pendant" ? item.chain : item;
+  const thingToStore = true ? item.chain : item;
 
   storage.tree.push(thingToStore);
killedBy: The packer when packing a necklace with other stones large others
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Amber", "type": "Beads"}
Received: undefined

[Killed] ConditionalExpression
src/index.ts:27:24
 };
 
 const treeHandler: LeafStorageHandler = (storage, item) => {
-  const thingToStore = item.type === "Pendant" ? item.chain : item;
+  const thingToStore = false ? item.chain : item;
 
   storage.tree.push(thingToStore);
killedBy: The packer when packing a necklace with other stones large pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  0
+ Received  + 11

  Object {
    "_kind": "Necklace",
+   "chain": Object {

[Killed] BlockStatement
src/index.ts:34:56
   return Result.Success
 }
 
-const safeHandler: StorageHandler = (storage, item) => {
-  if (item.stone !== "Diamond") {
-    return Result.Skipped;
-  }
-
-  storage.safe.push(item);
-
-  return Result.Success;
-};
+const safeHandler: StorageHandler = (storage, item) => {};
 
 export function packNecklace(
killedBy: The packer when packing a necklace with diamond
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Diamond", "type": "Chain"}
Received: undefined

[Killed] EqualityOperator
src/index.ts:35:7
 }
 
 const safeHandler: StorageHandler = (storage, item) => {
-  if (item.stone !== "Diamond") {
+  if (item.stone === "Diamond") {
     return Result.Skipped;
   }
killedBy: The packer when packing a necklace with diamond
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Diamond", "type": "Chain"}
Received: undefined

[Killed] ConditionalExpression
src/index.ts:35:7
 }
 
 const safeHandler: StorageHandler = (storage, item) => {
-  if (item.stone !== "Diamond") {
+  if (false) {
     return Result.Skipped;
   }
killedBy: The packer when packing a necklace with other stones small
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Amber", "type": "Chain"}
Received: undefined

[Killed] BlockStatement
src/index.ts:47:3
 export function packNecklace(
   item: Necklace | PendantNecklace,
   storage: JewelleryStorage
-) {
-  const lastInChain = chain(topShelfHandler, treeHandler);
-  const chainRoot = chain(safeHandler, lastInChain);
-
-  chainRoot(storage, item);
-}
+) {}
 
 export function pack(item: Jewellery, storage: JewelleryStorage) {
killedBy: The packer when packing a necklace with diamond
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Diamond", "type": "Chain"}
Received: undefined

[Killed] ConditionalExpression
src/index.ts:55:7
 }
 
 export function pack(item: Jewellery, storage: JewelleryStorage) {
-  if (storage.travelRoll.includes(item) && item.size() !== "Large")
+  if (true)
     storage.box.topShelf.push(item);
   else if (item.stone === "Diamond") {
killedBy: The packer when packing a jewellery item given the travel roll already includes an item a large item
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not {"_kind": "Necklace", "chain": {"_kind": "Necklace", "size": [Function size], "stone": "Plain", "type": "Beads"}, "pendant": {"_kind": "Pendant", "size": [Function anonymous], "stone": "Amber"}, "size": [Function size], "stone": "Plain", "type": "Pendant"}

[Killed] EqualityOperator
src/index.ts:55:44
 }
 
 export function pack(item: Jewellery, storage: JewelleryStorage) {
-  if (storage.travelRoll.includes(item) && item.size() !== "Large")
+  if (storage.travelRoll.includes(item) && item.size() === "Large")
     storage.box.topShelf.push(item);
   else if (item.stone === "Diamond") {
killedBy: The packer when packing a jewellery item given the travel roll already includes an item a small diamond item
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Ring", "size": [Function anonymous], "stone": "Diamond"}
Received: undefined

[Killed] ConditionalExpression
src/index.ts:57:12
 export function pack(item: Jewellery, storage: JewelleryStorage) {
   if (storage.travelRoll.includes(item) && item.size() !== "Large")
     storage.box.topShelf.push(item);
-  else if (item.stone === "Diamond") {
+  else if (false) {
     storage.safe.push(item);
   } else if (item.size() === "Small") {
killedBy: The packer with diamond
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Ring", "size": [Function anonymous], "stone": "Diamond"}
Received: undefined

[Killed] ConditionalExpression
src/index.ts:57:12
 export function pack(item: Jewellery, storage: JewelleryStorage) {
   if (storage.travelRoll.includes(item) && item.size() !== "Large")
     storage.box.topShelf.push(item);
-  else if (item.stone === "Diamond") {
+  else if (true) {
     storage.safe.push(item);
   } else if (item.size() === "Small") {
killedBy: The packer with other stones a small item
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Ring", "size": [Function anonymous], "stone": "Amber"}
Received: undefined

[Killed] ConditionalExpression
src/index.ts:59:14
     storage.box.topShelf.push(item);
   else if (item.stone === "Diamond") {
     storage.safe.push(item);
-  } else if (item.size() === "Small") {
+  } else if (false) {
     storage.box.topShelf.push(item);
   } else if (item._kind === "Earring" && item.type === "Hoop") {
killedBy: The packer with other stones a small item
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Ring", "size": [Function anonymous], "stone": "Amber"}
Received: undefined

[Killed] ConditionalExpression
src/index.ts:59:14
     storage.box.topShelf.push(item);
   else if (item.stone === "Diamond") {
     storage.safe.push(item);
-  } else if (item.size() === "Small") {
+  } else if (true) {
     storage.box.topShelf.push(item);
   } else if (item._kind === "Earring" && item.type === "Hoop") {
killedBy: The packer when packing a jewellery item given the travel roll already includes an item a large item
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not {"_kind": "Necklace", "chain": {"_kind": "Necklace", "size": [Function size], "stone": "Plain", "type": "Beads"}, "pendant": {"_kind": "Pendant", "size": [Function anonymous], "stone": "Amber"}, "size": [Function size], "stone": "Plain", "type": "Pendant"}

[Killed] ConditionalExpression
src/index.ts:61:14
     storage.safe.push(item);
   } else if (item.size() === "Small") {
     storage.box.topShelf.push(item);
-  } else if (item._kind === "Earring" && item.type === "Hoop") {
+  } else if (true) {
     storage.tree.push(item);
   } else if (
killedBy: The packer with other stones a large item earring of type drop with a non-plain stone
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Earring", "size": [Function size], "stone": "Amber", "type": "Drop"}
Received: undefined

[Killed] ConditionalExpression
src/index.ts:61:14
     storage.safe.push(item);
   } else if (item.size() === "Small") {
     storage.box.topShelf.push(item);
-  } else if (item._kind === "Earring" && item.type === "Hoop") {
+  } else if (false) {
     storage.tree.push(item);
   } else if (
killedBy: The packer with other stones a large item earring of type hoop
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Earring", "size": [Function size], "stone": "Amber", "type": "Hoop"}
Received: undefined

[Killed] LogicalOperator
src/index.ts:64:5
   } else if (item._kind === "Earring" && item.type === "Hoop") {
     storage.tree.push(item);
   } else if (
-    item._kind === "Earring" &&
-    item.type === "Drop" &&
-    item.stone !== "Plain"
+    item._kind === "Earring" && item.type === "Drop" || item.stone !== "Plain"
   ) {
     storage.box.topShelf.push(item);
killedBy: The packer with other stones a large item earring of type drop with stone
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Earring", "size": [Function size], "stone": "Plain", "type": "Drop"}
Received: undefined

[Killed] ConditionalExpression
src/index.ts:64:5
   } else if (item._kind === "Earring" && item.type === "Hoop") {
     storage.tree.push(item);
   } else if (
-    item._kind === "Earring" &&
-    item.type === "Drop" &&
-    item.stone !== "Plain"
+    false
   ) {
     storage.box.topShelf.push(item);
killedBy: The packer with other stones a large item earring of type drop with a non-plain stone
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Earring", "size": [Function size], "stone": "Amber", "type": "Drop"}
Received: undefined

[Killed] EqualityOperator
src/index.ts:65:5
     storage.tree.push(item);
   } else if (
     item._kind === "Earring" &&
-    item.type === "Drop" &&
+    item.type !== "Drop" &&
     item.stone !== "Plain"
   ) {
killedBy: The packer with other stones a large item earring of type drop with a non-plain stone
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Earring", "size": [Function size], "stone": "Amber", "type": "Drop"}
Received: undefined

[Survived] ConditionalExpression
src/index.ts:65:5
     storage.tree.push(item);
   } else if (
     item._kind === "Earring" &&
-    item.type === "Drop" &&
+    true &&
     item.stone !== "Plain"
   ) {

[Killed] ConditionalExpression
src/index.ts:66:5
   } else if (
     item._kind === "Earring" &&
     item.type === "Drop" &&
-    item.stone !== "Plain"
+    true
   ) {
     storage.box.topShelf.push(item);
killedBy: The packer with other stones a large item earring of type drop with stone
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Earring", "size": [Function size], "stone": "Plain", "type": "Drop"}
Received: undefined

[Killed] EqualityOperator
src/index.ts:66:5
   } else if (
     item._kind === "Earring" &&
     item.type === "Drop" &&
-    item.stone !== "Plain"
+    item.stone === "Plain"
   ) {
     storage.box.topShelf.push(item);
killedBy: The packer with other stones a large item earring of type drop with a non-plain stone
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Earring", "size": [Function size], "stone": "Amber", "type": "Drop"}
Received: undefined

[Killed] BlockStatement
src/index.ts:67:5
     item._kind === "Earring" &&
     item.type === "Drop" &&
     item.stone !== "Plain"
-  ) {
-    storage.box.topShelf.push(item);
-  } else if (item._kind === "Earring" && item.type === "Drop") {
+  ) {} else if (item._kind === "Earring" && item.type === "Drop") {
     storage.box.mainSection.push(item);
   } else if (item._kind === "Necklace" && item.type === "Pendant") {
killedBy: The packer with other stones a large item earring of type drop with a non-plain stone
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Earring", "size": [Function size], "stone": "Amber", "type": "Drop"}
Received: undefined

[Killed] EqualityOperator
src/index.ts:69:14
     item.stone !== "Plain"
   ) {
     storage.box.topShelf.push(item);
-  } else if (item._kind === "Earring" && item.type === "Drop") {
+  } else if (item._kind !== "Earring" && item.type === "Drop") {
     storage.box.mainSection.push(item);
   } else if (item._kind === "Necklace" && item.type === "Pendant") {
killedBy: The packer with other stones a large item earring of type drop with stone
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Earring", "size": [Function size], "stone": "Plain", "type": "Drop"}
Received: undefined

[Killed] ConditionalExpression
src/index.ts:69:14
     item.stone !== "Plain"
   ) {
     storage.box.topShelf.push(item);
-  } else if (item._kind === "Earring" && item.type === "Drop") {
+  } else if (false) {
     storage.box.mainSection.push(item);
   } else if (item._kind === "Necklace" && item.type === "Pendant") {
killedBy: The packer with other stones a large item earring of type drop with stone
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Earring", "size": [Function size], "stone": "Plain", "type": "Drop"}
Received: undefined

[Killed] BlockStatement
src/index.ts:71:68
     storage.box.topShelf.push(item);
   } else if (item._kind === "Earring" && item.type === "Drop") {
     storage.box.mainSection.push(item);
-  } else if (item._kind === "Necklace" && item.type === "Pendant") {
-    storage.tree.push(item.chain);
-    storage.box.topShelf.push(item.pendant);
-  } else if (item._kind === "Necklace") {
+  } else if (item._kind === "Necklace" && item.type === "Pendant") {} else if (item._kind === "Necklace") {
     storage.tree.push(item);
   } else {
killedBy: The packer with other stones a large item necklace with a pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Plain", "type": "Beads"}
Received: undefined

[Killed] ConditionalExpression
src/index.ts:71:14
     storage.box.topShelf.push(item);
   } else if (item._kind === "Earring" && item.type === "Drop") {
     storage.box.mainSection.push(item);
-  } else if (item._kind === "Necklace" && item.type === "Pendant") {
+  } else if (true) {
     storage.tree.push(item.chain);
     storage.box.topShelf.push(item.pendant);
killedBy: The packer with other stones a large item necklace without a pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Amber", "type": "Beads"}
Received: undefined

[Killed] BlockStatement
src/index.ts:74:41
   } else if (item._kind === "Necklace" && item.type === "Pendant") {
     storage.tree.push(item.chain);
     storage.box.topShelf.push(item.pendant);
-  } else if (item._kind === "Necklace") {
-    storage.tree.push(item);
-  } else {
+  } else if (item._kind === "Necklace") {} else {
     storage.dresserTop.push(item);
   }
killedBy: The packer with other stones a large item necklace without a pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Amber", "type": "Beads"}
Received: undefined

[Killed] EqualityOperator
src/index.ts:74:14
   } else if (item._kind === "Necklace" && item.type === "Pendant") {
     storage.tree.push(item.chain);
     storage.box.topShelf.push(item.pendant);
-  } else if (item._kind === "Necklace") {
+  } else if (item._kind !== "Necklace") {
     storage.tree.push(item);
   } else {
killedBy: The packer with other stones a large item necklace without a pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Amber", "type": "Beads"}
Received: undefined

[Killed] BlockStatement
src/index.ts:76:10
     storage.box.topShelf.push(item.pendant);
   } else if (item._kind === "Necklace") {
     storage.tree.push(item);
-  } else {
-    storage.dresserTop.push(item);
-  }
+  } else {}
 
   if (storage.travelRoll.includes(item))
killedBy: The packer with other stones a large item unknown large item with a pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Unknown", "size": [Function size], "stone": "Amber"}
Received: undefined

[Killed] ConditionalExpression
src/index.ts:80:7
     storage.dresserTop.push(item);
   }
 
-  if (storage.travelRoll.includes(item))
+  if (false)
     storage.travelRoll = storage.travelRoll.filter((x) => x !== item);
 }
killedBy: The packer when packing a jewellery item given the travel roll already includes an item a large item
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"_kind": "Necklace", "chain": {"_kind": "Necklace", "size": [Function size], "stone": "Plain", "type": "Beads"}, "pendant": {"_kind": "Pendant", "size": [Function anonymous], "stone": "Amber"}, "size": [Function size], "stone": "Plain", "type": "Pendant"}]

[Survived] ConditionalExpression
src/index.ts:80:7
     storage.dresserTop.push(item);
   }
 
-  if (storage.travelRoll.includes(item))
+  if (true)
     storage.travelRoll = storage.travelRoll.filter((x) => x !== item);
 }

[Killed] ConditionalExpression
src/index.ts:81:59
   }
 
   if (storage.travelRoll.includes(item))
-    storage.travelRoll = storage.travelRoll.filter((x) => x !== item);
+    storage.travelRoll = storage.travelRoll.filter((x) => true);
 }
 
killedBy: The packer when packing a jewellery item given the travel roll already includes an item a large item
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"_kind": "Necklace", "chain": {"_kind": "Necklace", "size": [Function size], "stone": "Plain", "type": "Beads"}, "pendant": {"_kind": "Pendant", "size": [Function anonymous], "stone": "Amber"}, "size": [Function size], "stone": "Plain", "type": "Pendant"}]

[Killed] EqualityOperator
src/index.ts:81:59
   }
 
   if (storage.travelRoll.includes(item))
-    storage.travelRoll = storage.travelRoll.filter((x) => x !== item);
+    storage.travelRoll = storage.travelRoll.filter((x) => x === item);
 }
 
killedBy: The packer when packing a jewellery item given the travel roll already includes an item a large item
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"_kind": "Necklace", "chain": {"_kind": "Necklace", "size": [Function size], "stone": "Plain", "type": "Beads"}, "pendant": {"_kind": "Pendant", "size": [Function anonymous], "stone": "Amber"}, "size": [Function size], "stone": "Plain", "type": "Pendant"}]

[Killed] BlockStatement
src/index.ts:84:49
     storage.travelRoll = storage.travelRoll.filter((x) => x !== item);
 }
 
-export function makeStorage(): JewelleryStorage {
-  return {
-    box: {
-      mainSection: [],
-      topShelf: [],
-      ringCompartment: [],
-    },
-
-    safe: [],
-    tree: [],
-    dresserTop: [],
-    travelRoll: [],
-  };
-}
+export function makeStorage(): JewelleryStorage {}
 
killedBy: The packer when packing a necklace with diamond
statusReason: TypeError: Cannot read properties of undefined (reading 'safe')

[Killed] ObjectLiteral
src/index.ts:85:10
 }
 
 export function makeStorage(): JewelleryStorage {
-  return {
-    box: {
-      mainSection: [],
-      topShelf: [],
-      ringCompartment: [],
-    },
-
-    safe: [],
-    tree: [],
-    dresserTop: [],
-    travelRoll: [],
-  };
+  return {};
 }
 
killedBy: The packer when packing a necklace with diamond
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ArrayDeclaration
src/index.ts:87:20
 export function makeStorage(): JewelleryStorage {
   return {
     box: {
-      mainSection: [],
+      mainSection: ["Stryker was here"],
       topShelf: [],
       ringCompartment: [],
killedBy: The packer with other stones a large item earring of type drop with stone
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Earring", "size": [Function size], "stone": "Plain", "type": "Drop"}
Received: "Stryker was here"

[Killed] ArrayDeclaration
src/index.ts:88:17
   return {
     box: {
       mainSection: [],
-      topShelf: [],
+      topShelf: ["Stryker was here"],
       ringCompartment: [],
     },
killedBy: The packer when packing a necklace with other stones small
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Amber", "type": "Chain"}
Received: "Stryker was here"

[Survived] ArrayDeclaration
src/index.ts:89:24
     box: {
       mainSection: [],
       topShelf: [],
-      ringCompartment: [],
+      ringCompartment: ["Stryker was here"],
     },
 

[Killed] ArrayDeclaration
src/index.ts:92:11
       ringCompartment: [],
     },
 
-    safe: [],
+    safe: ["Stryker was here"],
     tree: [],
     dresserTop: [],
killedBy: The packer when packing a necklace with diamond
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Diamond", "type": "Chain"}
Received: "Stryker was here"
