[Killed] EqualityOperator
src/chainOfResponsibility.ts:26:7
 export const chain = (currentHandler: StorageHandler, nextHandler: StorageHandler): StorageHandler => (...args) => {
   const result = currentHandler(...args);
 
-  if (result === Result.Skipped) {
+  if (result !== Result.Skipped) {
     return nextHandler(...args);
   }
killedBy: The packer when packing a necklace with other stones small
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Amber", "type": "Chain"}
Received: undefined
