[Killed] BlockStatement
src/index.ts:9:60
 } from "./jewellery";
 import { StorageHandler, Result, LeafStorageHandler, chain } from './chainOfResponsibility';
 
-const topShelfHandler: StorageHandler = (storage, item) => {
-  if (item.size() === "Small") {
-    storage.box.topShelf.push(item);
-
-    return Result.Success;
-  }
-
-  // TODO: this path skips futher processing of the necklace
-  // even though just the pendant has been stored
-  if (item.type === "Pendant") {
-    storage.box.topShelf.push(item.pendant);
-
-    // TODO: tmep fix; the result is not accurate
-    // the handler was successful, but the pendant is only partially stored;
-    return Result.Skipped;
-  }
-
-  return Result.Skipped;
-};
+const topShelfHandler: StorageHandler = (storage, item) => {};
 
 const treeHandler: LeafStorageHandler = (storage, item) => {
killedBy: The packer when packing a necklace with other stones small
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Amber", "type": "Chain"}
Received: undefined

[Killed] ConditionalExpression
src/index.ts:18:7
 
   // TODO: this path skips futher processing of the necklace
   // even though just the pendant has been stored
-  if (item.type === "Pendant") {
+  if (false) {
     storage.box.topShelf.push(item.pendant);
 
killedBy: The packer when packing a necklace with other stones large pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Pendant", "size": [Function anonymous], "stone": "Amber"}
Received: undefined

[Killed] EqualityOperator
src/index.ts:18:7
 
   // TODO: this path skips futher processing of the necklace
   // even though just the pendant has been stored
-  if (item.type === "Pendant") {
+  if (item.type !== "Pendant") {
     storage.box.topShelf.push(item.pendant);
 
killedBy: The packer when packing a necklace with other stones large pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Pendant", "size": [Function anonymous], "stone": "Amber"}
Received: undefined

[Killed] EqualityOperator
src/index.ts:30:24
 };
 
 const treeHandler: LeafStorageHandler = (storage, item) => {
-  const thingToStore = item.type === "Pendant" ? item.chain : item;
+  const thingToStore = item.type !== "Pendant" ? item.chain : item;
 
   storage.tree.push(thingToStore);
killedBy: The packer when packing a necklace with other stones large pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  0
+ Received  + 11

  Object {
    "_kind": "Necklace",
+   "chain": Object {

[Killed] LogicalOperator
src/index.ts:58:7
 }
 
 export function pack(item: Jewellery, storage: JewelleryStorage) {
-  if (storage.travelRoll.includes(item) && item.size() !== "Large")
+  if (storage.travelRoll.includes(item) || item.size() !== "Large")
     storage.box.topShelf.push(item);
   else if (item.stone === "Diamond") {
killedBy: The packer when packing a jewellery item with diamond
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Ring", "size": [Function anonymous], "stone": "Diamond"}
Received: undefined

[Killed] BlockStatement
src/index.ts:60:38
 export function pack(item: Jewellery, storage: JewelleryStorage) {
   if (storage.travelRoll.includes(item) && item.size() !== "Large")
     storage.box.topShelf.push(item);
-  else if (item.stone === "Diamond") {
-    storage.safe.push(item);
-  } else if (item.size() === "Small") {
+  else if (item.stone === "Diamond") {} else if (item.size() === "Small") {
     storage.box.topShelf.push(item);
   } else if (item._kind === "Earring" && item.type === "Hoop") {
killedBy: The packer when packing a jewellery item with diamond
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Ring", "size": [Function anonymous], "stone": "Diamond"}
Received: undefined

[Killed] BlockStatement
src/index.ts:62:39
     storage.box.topShelf.push(item);
   else if (item.stone === "Diamond") {
     storage.safe.push(item);
-  } else if (item.size() === "Small") {
-    storage.box.topShelf.push(item);
-  } else if (item._kind === "Earring" && item.type === "Hoop") {
+  } else if (item.size() === "Small") {} else if (item._kind === "Earring" && item.type === "Hoop") {
     storage.tree.push(item);
   } else if (
killedBy: The packer when packing a jewellery item with other stones a small item
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Ring", "size": [Function anonymous], "stone": "Amber"}
Received: undefined

[Killed] EqualityOperator
src/index.ts:64:14
     storage.safe.push(item);
   } else if (item.size() === "Small") {
     storage.box.topShelf.push(item);
-  } else if (item._kind === "Earring" && item.type === "Hoop") {
+  } else if (item._kind !== "Earring" && item.type === "Hoop") {
     storage.tree.push(item);
   } else if (
killedBy: The packer when packing a jewellery item with other stones a large item earring of type hoop
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Earring", "size": [Function size], "stone": "Amber", "type": "Hoop"}
Received: undefined

[Killed] ConditionalExpression
src/index.ts:67:5
   } else if (item._kind === "Earring" && item.type === "Hoop") {
     storage.tree.push(item);
   } else if (
-    item._kind === "Earring" &&
-    item.type === "Drop" &&
-    item.stone !== "Plain"
+    true
   ) {
     storage.box.topShelf.push(item);
killedBy: The packer when packing a jewellery item with other stones a large item earring of type drop with stone
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Earring", "size": [Function size], "stone": "Plain", "type": "Drop"}
Received: undefined

[Killed] ConditionalExpression
src/index.ts:67:5
   } else if (item._kind === "Earring" && item.type === "Hoop") {
     storage.tree.push(item);
   } else if (
-    item._kind === "Earring" &&
-    item.type === "Drop" &&
+    true &&
     item.stone !== "Plain"
   ) {
killedBy: The packer when packing a jewellery item with other stones a large item necklace without a pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Amber", "type": "Beads"}
Received: undefined

[Killed] ConditionalExpression
src/index.ts:72:14
     item.stone !== "Plain"
   ) {
     storage.box.topShelf.push(item);
-  } else if (item._kind === "Earring" && item.type === "Drop") {
+  } else if (true) {
     storage.box.mainSection.push(item);
   } else if (item._kind === "Necklace" && item.type === "Pendant") {
killedBy: The packer when packing a jewellery item with other stones a large item necklace with a pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Plain", "type": "Beads"}
Received: undefined

[Killed] LogicalOperator
src/index.ts:74:14
     storage.box.topShelf.push(item);
   } else if (item._kind === "Earring" && item.type === "Drop") {
     storage.box.mainSection.push(item);
-  } else if (item._kind === "Necklace" && item.type === "Pendant") {
+  } else if (item._kind === "Necklace" || item.type === "Pendant") {
     storage.tree.push(item.chain);
     storage.box.topShelf.push(item.pendant);
killedBy: The packer when packing a jewellery item with other stones a large item necklace without a pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Necklace", "size": [Function size], "stone": "Amber", "type": "Beads"}
Received: undefined

[Killed] ConditionalExpression
src/index.ts:77:14
   } else if (item._kind === "Necklace" && item.type === "Pendant") {
     storage.tree.push(item.chain);
     storage.box.topShelf.push(item.pendant);
-  } else if (item._kind === "Necklace") {
+  } else if (true) {
     storage.tree.push(item);
   } else {
killedBy: The packer when packing a jewellery item with other stones a large item unknown large item with a pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Unknown", "size": [Function size], "stone": "Amber"}
Received: undefined

[Killed] MethodExpression
src/index.ts:84:26
   }
 
   if (storage.travelRoll.includes(item))
-    storage.travelRoll = storage.travelRoll.filter((x) => x !== item);
+    storage.travelRoll = storage.travelRoll;
 }
 
killedBy: The packer when packing a jewellery item given the travel roll already includes an item a large item
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"_kind": "Necklace", "chain": {"_kind": "Necklace", "size": [Function size], "stone": "Plain", "type": "Beads"}, "pendant": {"_kind": "Pendant", "size": [Function anonymous], "stone": "Amber"}, "size": [Function size], "stone": "Plain", "type": "Pendant"}]

[Killed] ArrayDeclaration
src/index.ts:97:17
 
     safe: [],
     tree: [],
-    dresserTop: [],
+    dresserTop: ["Stryker was here"],
     travelRoll: [],
   };
killedBy: The packer when packing a jewellery item with other stones a large item unknown large item with a pendant
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_kind": "Unknown", "size": [Function size], "stone": "Amber"}
Received: "Stryker was here"
